Repository: didrocks/quickly
Catalog: po/*.po
Languages: cs, fr, gl, it, nl

source: It seems that you have no change to record.
cs: Záznam pravděpodobně neobsahuje změny.
fr: Il semble que vous n'ayez pas de changement à enregistrer
gl: Semella que vostede non cambiou o rexistro.
it: Pare che non ci siano modifiche da registrare.
nl: Het lijkt erop dat u geen veranderingen dient te bewaren.

source: project_name [options]
it: nome_progetto [opzioni]

source: Print the maximum debugging info (implies -vv)
it: Mostra il massimo delle informazioni di debug (implica -vv)

source: set error_level output to warning, info, and then debug
it: imposta error_level a warning, info e infine debug

source: foo should be assigned to bar
it: foo dovrebbe essere assegnato a bar

source: I'm launched and my args are: %s
it: Programma eseguito con i parametri: %s

source: end of prog
it: fine del programma

source: No %s command found in template %s.
it: Comando %s non trovato nel modello %s.

source: No template specified for command %s.
it: Nessun modello specificato per il comando %s.

source: Here, dialog-name is one or more words separated with dash For instance 'quickly add dialog dialog-name' will create: 1. A subclass of gtk.Dialog called DialogNameDialog in the module DialogNameDialog.py 2. A glade file called DialogNameDialog.ui in the ui directory 3. A catalog file called dialog_name_dialog.xml also in the ui directory To edit the UI for the dialog, run: $ quickly design To edit the behavior, run: $ quickly edit To use the dialog you have to invoke it from another python file: 1. Import the dialog import DialogNameDialog 2. Create an instance of the dialog dialog = DialogNameDialog.NewDialogNameDialog() 3. Run the dialog and hide the dialog result = dialog.run() dialog.hide()
it: In questo caso dialog-name è una o più parole separate dal trattino Ad esempio "quickly add dialog dialog-name" creerà: 1. Una sotto-classe di gtk.Dialog chiamata DialogNameDialog nel modulo DialogNameDialog.py 2. Un file glade chiamato DialogNameDialog.ui nella directory ui 3. Un file catalog chiamato dialog_name_dialog.xml sempre nella directory ui Per modificare l'interfaccia della dialog: $ quickly design Per modificarne il comportamento: $ quickly edit Per usare la dialog occorre invocarla da un altro file python: 1. Import della finestra dialog import DialogNameDialog 2. Creazione di una istanza della dialog dialog = DialogNameDialog.NewDialogNameDialog() 3. Esecuzione della finestra e successivamente viene nascosta result = dialog.run() dialog.hide()

source: adds a help topic to your project The topic will automatically appear as an item on the help contents page. The help contents can be displayed by the user clicking on the help->contents menu item. To edit the topic, run: $ quickly edit All the help pages are loaded into your editor as well as the python files.
it: aggiunge un argomento nella guida del progetto. L'argomento apparirà come voce nella pagina contenuti. La pagina contenuti viene mostrata all'utente facendo clic nel menù aiuto->contenuti. Per modificare la pagina dell'argomento eseguire: $ quickly edit Tutte le pagine di aiuto sono caricate nell'editor assieme ai file python.

source: Creates a debian file (deb) from your project. Before running the package command you can edit the Icon and Category entry of *.desktop.in file, where * is the name of your project. Note that if you didn't run 'quickly release', 'quickly share' or 'quickly change-lp-project' you may miss the name, email in setup.py. You can edit them if you don't want to use any of these commands afterwards. Those changes are not a mandatory at all for testing purpose. Passing --extras will create a package similar to one created by the submitubuntu command. It will install files into /opt.
it: Crea un pacchetto debian (deb) per il progetto. Prima di eseguira il comando è possibile modificare l'icona e la categoria nel file *.desktop.in, dove * rappresenta il nome del progetto. Notare che se non si esegue "quickly release", "quickly share" oppure "quickly change-lp-project" si può perdere il nome, email in setup.py. È possibile modificarlo manualmente se non si desidera usare uno di questo comandi. Questi cambiamenti non sono obbligatori per svolgere delle prove. Fornendo il parametro --extras verrà creato il pacchetto simile a quello creato dal comando submitubuntu. I file verranno installati in /opt.

source: Fatal:
cs: Fatální:
fr: Erreur fatale :
nl: Rampzalig:

source: Initial Launchpad binding. You must choose "Change Anything"
fr: Initialisation de la configuration de Launchpad. Vous devez choisir "Change Anything"
gl: Ligazón inicial de Launchpad. Vostede debe seleccionar "Cambiar algunha cousa"
nl: Initiële Launchpad verbinding. Je moet kiezen voor "Wijzig Alles"

source: Launchpad connexion is ok
fr: Connexion à Launchpad réussie
gl: A conexión con Launchpad está correcta
nl: Launchpad verbinding is ok

source: No launchpad project give, aborting.
cs: Nezadán projekt Launchpadu, přerušuji.
fr: Pas de projet sur Launchpad défini, annulation.
gl: Non se proporcionou un proxecto de launchpad, abortando.
nl: Geen launchpad project opgegeven, afbreken.

source: Project name: %s
cs: Název projektu: %s
fr: Nom du projet : %s
gl: Nome do proxecto: %s
nl: Project naam: %s

source: Usage: quickly [OPTIONS] command ... Options: -t, --template <template> Template to use if it differs from default project one one used to create the project) --staging Target launchpad staging server --verbose Verbose mode -h, --help Show help information Commands: create <template> <project-name> (template is mandatory for this command) quickly <template_origin> <template_dest> to create a create derived template getstarted to get some starting hints Examples: quickly create ubuntu-project foobar quickly push 'awesome new comment system' quickly -t cool-template push 'awesome new comment system'
gl: Uso: quickly [OPCIÓNS] orde ... Opcións: -t, --template <modelo> modelo a empregar se difire do predefinido proxecto un un empregado para crear o proxecto) --staging Servidor de staging en Launchpad de destino --verbose Modo de saída detallada -h, --help Mostrar información de axuda Ordes: create <modelo> <nome-proxecto> (o modelo é obrigatorio para esta orde) quickly <modelo_orixe> <modelo_dest> para creare un modelo derivado Comece a empregalo para obter suxerencias de inicio Exemplos: quickly create ubuntu-project foobar quickly push 'un incríbel comentario novo do sistema' quickly -t modelo-chulo push 'un incríbel comentario novo do sistema'
nl: Gebruik: quickly [OPTIES] command ... Opties: -t, --template <template> Template te gebruiken indien verschillend van default project one one gebruikt om het project aan te maken) --staging Doel launchpad staging server --verbose Verbose mode -h, --help Toon help informatie Commando's: create <template> <project-name> (template is mandatory voor dit commando) quickly <template_origin> <template_dest> om een create aan te maken van een create afgeleide template getstarted om enkele starthints te verkrijgen Voorbeelden: quickly create ubuntu-project foobar quickly push 'awesome new comment system' quickly -t cool-template push 'awesome new comment system'

source: ERROR: Unknown option: %s
gl: ERRO: Opción descoñecida: %s
nl: FOUT: Onbekende optie: %s

source: ERROR: No %s command found in template %s.
nl: FOUT: Geen %s commando gevonden in het template %s.

source: Aborting.
nl: Afbreken.

source: ERROR: %s command must be followed by a template and no template was found on the command line.
nl: FOUT: %s commando moet gevolgd worden door een template en geen enkel template was gevonden op de commando lijn.

source: Candidates template are: %s
nl: Mogelijke template's zijn: %s

source: No template were found on the command line for command %s.
nl: Geen enkel template was gevonden op de commando lijn voor het commando %s.

source: ERROR: No %s command found.
nl: FOUT: Geen %s commando gevonden.

source: No gpg key set. Take a look at quickly tutorial to learn how to setup one
nl: Geen gpg key ingesteld. Neem een kijkje in de quickly handleiding om te leren hoe je er een aanmaakt

source: Usage: $quickly release Posts a release of your project to a PPA on launchpad so that users can install the application on their system. You can also execute: $quickly release <release_number> of you don't want to use current release_number. The release_number must be a number. $quickly release <release_number> notes about changes where "notes about changes" is optional text describing what changes were made since the last save Before running quickly release, you should: create your account and a project page on http://launchpad.net. You also have to add a PPA to your launchpad account. Name, email and version setup.py will be automatically changed. (version will be <current_release> and bzr will commit and tagged. Once the release is done, <current_release> will be incremented by 0.1 to be ready for next release. If you previously used quickly shared <current_release>~publicX will be dropped to release <current_release> version (<current_release>~publicX < <current_release>) You can modify the description and long description if you wish. You can run $quickly package and test your package to make sure it installs as expected. (This is not mandatory)
nl: Gebruik: $quickly release Verstuurt een vrijgave van uw project naar een PPA op launchpad zodat gebruikers de applicatie op hun systeem kunnen installeren. U kan ook hetvolgende uitvoeren: $quickly release <release_nummer> als je niet de huidige release_nummer wilt gebruiken. Het release_nummer moet een nummer zijn. $quickly release <release_nummer> meldingen van wijzigingen waarbij "meldingen van wijzigingen" optionele tekst is die beschrijft welke wijziginen gemaakt werden sinds de laatste opslag Vooraleer quickly release uit te voeren, zou u het volgende moeten doen:maak uw account aan en een projectpagina op http://launchpad.net. U dient ook een PPA toe te voegen aan uw launchpad account. Naam, email en versie setup.py zullen automatisch veranderd worden. (versie zal <current_release> worden en bzr zal gecommit en getagged worden. Eens de vrijgave gebeurd is, zal <current_release> geïncrementeert worden met 0.1 om klaar te zijn voor de volgende vrijgave. Als je vroeger gebruik maakte van quickly shared <current_release> zal ~publicX worden verwaarloosd voor versie <current_release> (<current_release>~publicX < <current_release>) U kan de beschrijving en lange beschrijving aanpassen als je wenst. U kan $quickly package uitvoeren en uw package testen om zeker te zijn dat het instaleerd zoals verwacht. (Dit is niet verplicht)

source: Release version not found in setup.py and no version specified in command line.
cs: Verze vydání nebyla nenalezena v setup.py a žádná verze nebyla neupřesněna ani v příkazovém řádku.
fr: Numéro de version non trouvé dans setup.py, et aucune version n'a été spécifiée sur la ligne de commande.
gl: Non se atopou a versión de lanzamento no setup.py e non se especificou ningunha versión na liña de ordes.
nl: Vrijgave versie is niet gevonden insetup.py en er is geen versie vermeld in de commando lijn.

source: quickly released
cs: quickly vydáno
fr: Publié par quickly
gl: lanzouse quickly
nl: quickly vrijgegeven

source: Release version specified in command arguments or in setup.py is not a valid number.
cs: Verze vydání zadaná v příkazové řádce nebo v setup.py není správné číslo.
fr: Le numéro de version spécifié comme argument de la ligne de commande ou dans le fichier setup.py n'est pas un nombre valide.
gl: A versión de lanzamento especificada nos argumentos da orde ou no setup.py non é un número válido.
nl: Vrijgave versie gespecifieerd en commando argumenten of in setup.py is geen geldige nummer.

source: ppa:%s:%s does not exist. Please create one on launchpad before releasing
cs: ppa:%s:%s neexistuje. Vytvořte ho před vydáváním
fr: ppa:%s:%s n'existe pas. Veuillez créer un PPA sur Launchpad avant de distribuer le programme
gl: ppa:%s:%s non existe. Cree un en launchpad antes de efectuar o lanzamento.
nl: ppa:%s:%s bestaat niet. Maak er alsjeblief een aan op launchpad vooraleer vrij te geven

source: No quickly data path found.
nl: Geen quickly data path gevonden.

source: Quickly %s Python interpreter: %s %s Python standard library: %s Quickly used library: %s Quickly data path: %s Quickly detected template directories: %s Copyright 2009 Canonical Ltd. #Author 2009 Rick Spencer #Author 2009 Didier Roche https://launchpad.net/quickly quickly comes with ABSOLUTELY NO WARRANTY. quickly is free software, and you may use, modify and redistribute it under the terms of the GNU General Public License version 3 or later.
nl: Quickly %s Python interpreter: %s %s Python standaard bibliotheek: %s Quickly gebruikte bibliotheek: %s Quickly data pad: %s Quickly gedetecteerde template mappen: %s Copyright 2009 Canonical Ltd. #Auteur 2009 Rick Spencer #Auteur 2009 Didier Roche https://launchpad.net/quickly quickly komt met ABSOLUUT GEEN GARANTIES. quickly is vrije software, en je mag het gebruiken, aanpassen en terug verdelen onder de "Terms of the GNU General Public License" versie 3 of later.

source: ERROR: unpermitted character in name. Letters and digits only.
nl: FOUT: oneldig karakter in naam. Enkel letters en cijfers.

source: Usage: $quickly package Creates a debian file (deb) from your project. Before running the package command you can edit the Icon and Category entry of *.desktop.in file, where * is the name of your project. Note that if you didn't run quickly release, quickly share or quickly change-lp-project you may miss the name, email in setup.py. You can edit them if you don't want to use any of these commands afterwards. Those changes are not a mandatory at all for testing purpose.
nl: Gebruik: $quickly package Maakt een debian file (deb) van uw project. Alvorens het package commando uit te voeren kan je de Icon en Category ingang bewerken van het *.desktop.in bestand, waarbij * de naam is van uw project. Merk op dat als je niet quickly release uitvoerde, quickly share of quickly change-lp-project u de naam, email mogelijk mist in setup.py. U kan deze bewerken als je geen enkel van deze commando's nadien wilt gebruiken. Deze wijzigingen zijn zeker niet verplicht voor test doeleinden.

source: Usage: $quickly save notes about changes where "notes about changes" is optional text describing what changes were made since the last save. This command commits all changes since the last save to bzr. Note that it does not push changes to any back up location. If you need revert or otherwise use the revision control, us bzr directly: $bzr help
nl: Gebruik: $quickly save bericht van wijzigingen waarbij "bericht van wijzigingen" een optionele tekst is die beschrijft welke veranderingen gemaakt werden sedert vorige opslag. Dit commando verzent alle wijzigingen sedert de laatste opslag naar bzr. Merk op dat het geen enkele wijziging opslaat naar enige back up locatie. Als je moet nazien of anders gebruik wenst te maken van de revision control, gebruik bzr direct: $bzr help

source: Usage: $quickly license <Your_Licence> Adds license to project files. Before using this command, you should: 1. Edit the file Copyright to include your authorship (this step is automatically done if you directly launch "$ quickly release" or "$ quickly share" before changing license) In this case, license is GPL-3 by default. 2. If you want to put your own quickly unsupported Licence, remove and replace the tags ### BEGIN AUTOMATIC LICENCE GENERATION and ### END AUTOMATIC LICENCE GENERATION in it by your own licence. 3. Executes either $ quickly license or $ quickly licence <License> where <License> can be either: - GPL-3 (default) - GPL-2 This will modify the Copyright file with the chosen licence (with GPL-3 by default). Updating previous chosen Licence if needed. If you previously removed the tags to add your own licence, it will leave it pristine. If no name is attributed to the Copyright, it will try to retrieve it from Launchpad (in quickly release or quickly share command only) Finally, this will copy the Copyright at the head of every files. Note that if you don't run quickly licence before calling quickly release or quickly share, this one will execute it for you and guess the copyright holder from your launchpad account if you didn't update it.
nl: Gebruik: $quickly license <Your_Licence> Voegt licensie toe aan project files. Vooraleer dit commando te gebruiken, dient u: 1. Het bestand Copyright te bewerken zodat uw auteurschap toegevoegd wordt (deze stap gebeurt automatisch als je direct "$ quickly release" of "$ quickly share" uitvoert alvorens de licentie te wijzigen) In dat geval, is de licentie GPL-3 standaard. 2. Als je jouw eigen quickly unsupported Licence wenst toe te voegen, verwijder en vervang de tags ### BEGIN AUTOMATIC LICENCE GENERATION en ### END AUTOMATIC LICENCE GENERATION daarin door uw eigen licentie. 3. Voer ofwel $ quickly license of $ quickly licence <License> uit waarbij <License> hetvolgende kan zijn: - GPL-3 (standaard) - GPL-2 Dit zal het Copyright bestand vervangen met de gekozen licentie (met GPL-3 standaard). Vernieuwen van voordien gekozen Licence indien nodig. Als je vroeger de tags verving door uw eigen licentie, blijft die behouden. Indien er geen naam werd toegevoegd aan Copyright, zal dit trachten deze te verkrijgen van Launchpad (enkel in quickly release of quickly share commando's) Dit zal uiteindelijk de Copyright in het hoofd van elk bestand kopiëren. Merk op dat als je quickly licence niet uitvoert vooraleer quickly release of quickly share op te roepen, deze zal uitvoeren voor jou en de copyright eigenaars zal gokken vanuit jouw launchpad account als je het niet geüpdate hebt.

source: This license seems to be unsupported by quickly. If you think it really should, please open a bug in quickly bugtracker
cs: License se zdá být nepodporována. Pokud myslíte, že by opravdu být měla, prosím zadejte hlášení do bugtrackeru quickly
fr: Cette license semble ne pas être supportée par quickly. Si vous pensez qu'elle devrait néanmoins l'être, veuillez s'il vous plaît ouvrir un ticket dans le gestionnaire de bugs de quickly
gl: Esta licenza semella que non está soportada por quickly. Se pensas que si que o está, abre un bug no xestor de bugs de quickly.
nl: Deze licentie blijkt niet ondersteund doorquickly. Als je denkt dat het zeker moet, open dan een bug in quickly bugtracker

source: Copyright is not attributed. Edit the Copyright file to include your name for the copyright in place of <Your Name> <Your E-mail> or use quickly share/quickly release
cs: Copyright není přivlastněn. Upravte soubor copyrightu, aby obsahoval vaše jméno pro copyright v místě <Your Name> <Your E-mail> nebo použijte qucikly sdílet/quickly vydat
fr: Le droit de copie ("Copyright") n'est pas attribué. Modifiez le fichier Copyright pour y inclure votre nom à la place de <Your Name> <Your Email>, ou lancez quickly share / quickly release
gl: O copyright non está atribuído. Edita o ficheiro Copyright para incluír o teu nome no copyright no sitio de <Your Name> <Your E-mail> ou emprega compartir quickly/liberar quickly
nl: Copyright is niet toegevoegd. Bewerk het Copyright bestand om uw naam toe te voegen voor het copyright in plaats van <Your Name> <Your E-mail> of gebruik quickly share/quickly release

source: This command only take one optional argument: License
cs: Tento příkaz přijímá pouze jeden volitelný argument: licenci
fr: Cette commande n'accepte qu'un seul argument optionel : Licence
gl: Este comando só obtén un argumento opcional: A Licenza
nl: Dit commando maakt enkel gebruik van 1 optioneel argument: License

source: ERROR: Template '%s' not found.
cs: CHYBA: Šablona '%s' nebyla nalezena.
fr: ERREUR : Modèle '%s' introuvable
gl: ERRO: Non se atopou o modelo '%s'
nl: FOUT: Template '%s' niet gevonden.

source: ERROR: Template %s does not exist.
nl: FOUT: Template %s bestaat niet.

source: Arborting.
nl: Afbreken

source: Usage: $quickly run Runs your application. This is the best way to try test it out while you are developing it. It starts up the main project window.
nl: Gebruik: $quickly run Voert uw applicatie uit. Dit is de beste manier om uit te testen terwijl u het aan het ontwikkelen bent. Het start het hoofdvenster op.

source: Your application has been created! To start changing this user interface, run 'quickly glade', which will open Glade so you can edit the default windows and dialogs. To change the behavior and edit the python code, run 'quickly edit', which will bring up a text editor.
cs: Vaše aplikace byla vytvořena! Pro úpravu uživatelského rozhraní, spusťte 'quickly glade', který otevře Glade, takže budete moci měnit výchozí okna a dialogy. Pro změnu chování a úpravu python kódu, spusťte 'quickly edit', který spustí textový editor.
fr: Votre application a été créé ! Pour commencer à modifier l'interface, exécutez 'quickly glade', qui ouvrira Glade pour vous permettre de modifier la fenêtre par défaut et les autres dialogues. Pour changer le comportement et modifier le code python, exécutez 'quickly edit' , qui fera apparaître un éditeur de texte.
gl: O seu aplicativo foi creado! Para cambiar esta interface de usuario execute 'quickly glade', o que abrirá Glade para que poida editar as xanelas e diálogos predefinidos. Para cambiar o comportamento e editar o código python, execute 'quickly edit', o cal lanzará un editor de texto.
nl: Uw applicatie is gecreëerd! Om deze interface te beginnen wijzigen, voer 'quickly glade' uit, hetgeen Glade zal openen zodat je de standaard vensters en dialogen kunt bewerken. Om de python code te bewerken en het gedrag aan te passen, voer 'quickly edit' uit, hetwelke een tekst bewerker zal oproepen.

source: _File
cs: _Soubor
fr: _Fichier
gl: _Ficheiro
nl: _Bestand

source: Usage: $ quickly create ubuntu-project path/to/project_name where "project_name" is one or more words separated by an underscore and path/to can be any existing path. This will create and run a new project, including Python code, Glade files, and packaging files to make the project work. After creating the project, get started by: 1. Changing your working directory to the new project: $ cd path/to/project_name 2. Edit the UI with Glade: $ quickly glade 3. Edit the Python code: $ quickly edit
nl: Gebruik: $ quickly create ubuntu-project path/to/project_name waarbij "project_name" 1 of meerdere woorden gescheiden door underscore is/zijn en path/to eender welk bestaand path kan zijn. Dit zal een nieuw project aanmaken en draaien, inclusief Python code, Glade bestanden en packaging bestanden om het project te doen draaien. Na het project aangemaakt te hebben, begin dan bij: 1. Wijzig uw werk directory naar het nieuwe project: $ cd path/to/project_name 2. Bewerk de UI met Glade: $ quickly glade 3. Bewerk de Python code: $ quickly edit

source: ERROR: project name not defined. Usage is project_name
fr: ERREUR : nom de projet non défini. Celui-ci doit être passé en argument.
gl: ERRO: non se definiu o nome do proxecto. O uso correcto é nome_proxecto
nl: FOUT: project naam niet gedefineerd. gebruik is project_name

source: Directory %s created
cs: Adresář %s vytvořen
fr: Répertoire %s créé
gl: O cartafol %s foi creado
nl: Directory %s aangemaakt

source: Congrats, your new project is setup! cd %s/ to start hacking. Then '$ quickly tutorial' for quickly ubuntu-template tutorial and reference
nl: Gefeliciteerd, uw nieuwe project is gedefinieerd! cd %s/ om te beginnen hacken. Dan '$ quickly tutorial' voor quickly ubuntu-template handleiding en referentie

source: WARNING: No .quickly file found. Initiating a new one.
nl: WAARSCHUWING: Geen .quickly bestand gevonden. Aanmaken van een nieuwe.
