Repository: didrocks/quickly
Catalog: po/*.po
Languages: cs, fr, gl, it, nl

source: ERROR: Can't save configuration in %s
cs: CHYBA: Nelze uložit konfiguraci do %s
fr: ERREUR: Impossible d'enregistrer la configuration dans %s
gl: ERRO: Non se puido gardar a configuración en %s
nl: FOUT: KAn de configuratie niet opslaan in %s

source: Usage: $quickly share Updates your PPA with the the latest saved project changes. Before running quickly release, you should: create your account on http://launchpad.net. You also have to add a PPA to your launchpad account. Name, email and version setup.py will be automatically changed. (version will be <current_release~publicX> where X will be incremented at each quickly share execution) You can modify the description and long description if you wish.
nl: Gebruik: $quickly share Updates uw PPA met het laatst opgeslaan gewijzigd project. Vooralleer quickly release uit te voeren, dien je: uw account aan te maken op http://launchpad.net. U dient ook een PPA toe te voegen aan uw launchpad account. Naam, email en versie setup.py zullen automatisch gewijzigd worden. (versie zal worden <current_release~publicX> waarbij X geincrementeerd word elke keer dat quickly share uitgevoerd word) U kan de beschrijving en lange beschrijving aanpassen indien u wil.

source: ppa:%s:%s does not exist. Please create one on launchpad before sharing
cs: ppa:%s:%s neexistuje. Vytvořte ji na Launchpadu před sdílením
fr: ppa:%s:%s n'existe pas. Merci d'en créer un sur launchpad avant d'exécuter quickly share.
gl: O ppa:%s:%s non existe. Cree un novo en launchpad antes de compartig
nl: ppa:%s:%s bestaat niet. Gelieve een launchpad aan te maken vooralleer te delen

source: Minor release version specified before ~public in setup.py is not a valid number: %s
nl: Minor vrijgave versie gespecifieerd voor ~public in setup.py is geen geldig nummer: %s

source: Release version specified in setup.py is not a valid number.
cs: Verze vydání uvedená v setup.py není správné číslo.
fr: Le numéro de version spécifié dans setup.py n'est pas un nombre valide.
gl: A versión de liberación especificada en setup.py non é un número válido.
nl: Release versie gespecifieerd in setup.py is geen geldig nummer.

source: Usage: $quickly glade Opens Glade UI editor so that you can edit the UI for dialogs and windows in your project. Note that you *must* open Glade in this manner for quickly to work. If you try to open Glade directly, and the open the UI files, Glade will throw errors and won't open the files.
nl: Gebruik: $quickly glade Opent Glade UI bewerker zodat u de UI voor dialogen en windows in uw project kan aanpassen. Merk op dat u Glade "moet" openen op deze manier zodat quickly kan werken. Als je tracht Glade direct te openen, en dan de UI bestanden te openen, zal Glade fouten opwerpen en geen bestanden openen.

source: Usage: $ quickly tutorial Opens a web browser with the tutorial for ubuntu-project template.
nl: Gebruik: $ quickly tutorial Opent een web browser met de handleiding voor ubuntu-project template.

source: Usage: $ quickly edit A convenience command to open all of your python files in your project directory in your default editor, ready for editing. If you put yourself EDITOR or SELECTED_EDITOR environment variable, this latter will be used. Also, if you configured sensible-editor, this one will be choosed.
nl: Gebruik: $ quickly edit Een handig commando om alle python bestanden in uw project te openen directory in uw standaard bewerker, klaar vor wijzigen. Indien je zelf EDITOR of SELECTED_EDITOR omgevingsvariabele benoemde, zal dit latter gebruikt worden. Ook, indien je de sensible-editor configureerde, zal deze gekozen worden.

source: An error has occurred
cs: Vyskytla se chyba
fr: Une erreur a eu lieu
gl: Ocorreu un erro
nl: Er is een fout opgetreden

source: Usage: $ quickly dialog dialog_name where dialog_name is one or more words seperated with underscore This will create: 1. A subclass of gtk.Dialog called DialogNameDialog in the module DialogNameDialog.py 2. A glade file called DialogNameDialog.ui in the ui directory 3. A catalog file called dialog_name_dialog.xml also in the ui directory To edit the UI for the dialog, run: $ quickly glade To edit the behavior, run: $ quickly edit To use the dialog you have to invoke it from another python file: 1. Import the dialog import DialogNameDialog 2. Create an instance of the dialog dialog = DialogNameDialog.NewDialogNameDialog() 3. Run the dialog and hide the dialog result = dialog.run() dialog.hide()
nl: Gebruik: $ quickly dialog dialog_name Waarbij dialog_name een of meerdere woorden gescheiden door underscroe is/zijn Dit zal het volgende aanmaken: 1. Een subclasse van gtk.Dialog genaamd DialogNameDialog in de module DialogNameDialog.py 2. Een glade bestand genaamd DialogNameDialog.ui in de ui directory 3. Een catalog bestand genaamd dialog_name_dialog.xml ook in de ui directory Om de UI te bewerken van de dialogen, voer uit: $ quickly glade Om het gedrag te bewerken, voer uit: $ quickly edit Om de dialoog die je hebt te gebruiken vanuit een ander python bestand: 1. Import de dialog import DialogNameDialog 2. Maak een instance van de dialog dialog = DialogNameDialog.NewDialogNameDialog() 3. Voer de dialog uit en verberg de dialog result = dialog.run() dialog.hide()

source: Dialog command needs to be followed by new dialog name.
nl: Dialog commando's dienen gevolgd te worden door dialoog namen.

source: ERROR: Create command must be followed by a template and a project path
nl: FOUT: Create command dient gevolgd te worden door een template en een project path

source: %s does not exist
cs: %s neexistuje
fr: %s n'existe pas
gl: %s non existe
nl: %s bestaat niet

source: ------------------------------- Welcome to quickly! ------------------------------- You can create a project in executing 'quickly create <template_name> <your project>'. Example with ubuntu-project template: 1. create a Ubuntu Project and run the tutorial: $ quickly create ubuntu-project foo $ cd foo $ quickly tutorial 2. You can also try: $ quickly edit $ quickly glade $ quickly run Use bash completion to get every available commands 3. How to play with package and release: optional, but recommended to build first your package locally: $ quickly package BE WARNED: the two following commands will connect to Launchpad. You need at least having a Launchpad account and an opened ppa. You need also for quickly release a project where you can bind your work with. $ quickly release or $ quickly share Have Fun!
nl: ------------------------------- Welkom bij quickly! ------------------------------- Je kan een project aanmaken door het volgende uit te voeren 'quickly create <template_name> <your project>'. Voorbeeld met ubuntu-project template: 1. maak een Ubuntu Project en voer de ha,dleiding uit: $ quickly create ubuntu-project foo $ cd foo $ quickly tutorial 2. Je kan ook het volgende proberen:: $ quickly edit $ quickly glade $ quickly run Gebruik bash aanvullen om alle beschikbare commando's te tonen 3. Hoe spelen met package en vrijgave: optie, maar aangeraden om eerst lokaal uw package te maken: $ quickly package WEES GEWAARSCHUWD: de 2 volgende commando's zullen verbinden met Launchpad. U dient minstens over een Launchpad account en een geopende ppa te beschikken. U dent ook voor quickly release een project te hebben om uw werk met te koppelen. $ quickly release of $ quickly share Heb Plezier!

source: ERROR: No command provided to help command
nl: FOUT: Geen commando opgegeven voor help command

source: ERROR: help command must be followed by a template name for getting help from templates commands like %s.
nl: FOUT: help command dient gevolgd te worden door een template naam om hulp te krijgen over templates commando's zoals %s.

source: ERROR: No %s command found in %s template.
nl: FOUT: Geen %s commando gevonden in %s template.

source: ERROR: Quickly command must be followed by a template and a template destination path
nl: FOUT: Quickly command dient gevolgd te worden door een template en een template doel path

source: gtk-cancel
nl: gtk-annuleren

source: Usage: $ quickly change-lp-project Enable to set or change the launchpad project binded with the current ubuntu project.
nl: Gebruik: $ quickly change-lp-project Laat toe om te binden of te wijzigen van het launchpad project met het huidige ubuntu project.

source: Launchpad url: %s/%s
cs: Url Launchpadu: %s/%s
fr: URL sur Launchpad : %s/%s
gl: Url de launchpad: %s/%s

source: ERROR: unpermitted character in name. Letters and underscore ("_") only.
cs: CHYBA: nepovolený znak v názvu. Pouze písmena a podtržítko ("_").
fr: ERREUR : caractère non-permis dans le nom. Lettre et underscore ("_") uniquement.

source: Congrats, your new project is setup! cd %s/ to start hacking. Then '$ quickly help' for quickly tutorial and reference
cs: Gratulujeme, váš nový projekt je nastaven. Zadejte cd %s/ a můžete začít hackovat. Zadejte 'quickly help' pro tutoriál a referenční příručku.
fr: Félicitations, votre nouveau projet est créé ! Vous pouvez lancer 'cd %s' et démarrer. Ensuite, exécutez "$ quickly tutorial" pour obtenir un tutoriel d'utilisation du modèle ubuntu-project

source: WARNING: No .quickly file found. Initiate a new one
cs: VAROVÁNÍ: Soubor .quickly nenalezen. Vytvořte nový.
fr: AVERTISSEMENT: Aucun fichier .quickly trouvé. Création d'un nouveau.

source: Minor release version specified after ~public in setup.py is not a valid number: %s
cs: Minor verze vydání uvedená po ~public v setup.py není správné číslo: %s
fr: Le numéro de version mineur spécifié avant ~public dans setup.py n'est pas un nombre valide: %s

source: ------------------------------- Welcome to quickly! ------------------------------- You can create a project in executing 'quickly create <template_name> <your project>'. Example with ubuntu-project template: 1. create a Ubuntu Project and run the tutorial: $ quickly create ubuntu-project foo $ cd foo $ quickly help 2. You can also try: $ quickly edit $ quickly glade $ quickly run Use bash completion to get every available commands 3. How to play with package and release: optional, but recommended to build first your package locally: $ quickly package BE WARNED: the two following commands will connect to Launchpad. You need at least having a Launchpad account and an opened ppa. You need also for quickly release a project where you can bind your work with. $ quickly release or $ quickly share Have Fun!
fr: -------------------------------------- Bienvenue dans quickly! -------------------------------------- Vous pouvez créer un projet en exécutant 'quickly create <template_name> <your project>'. Exemple avec le modèle ubuntu-project: 1. Créez un projet Ubuntu et exécutez le tutoriel: $ quickly create ubuntu-project foo $ cd foo $ quickly tutorial 2. Vous pouvez aussi essayer: $ quickly edit $ quickly glade $ quickly run Utilisez l'auto-complétion (touche TAB) pour obtenir la liste des commandes disponibles. 3. Comment jouer avec le paquetage et la publication: optionnel, mais recommandé pour construire d'abord le paquet en local: $ quickly package ATTENTION: les deux commandes suivantes vont vous connecter sur Launchpad. Vous avez besoin d'un compte Launchpad et d'un ppa ouvert. Pour quickly release ,vous avez également besoin d'un projet où vous pouvez envoyer votre travail. $ quickly release ou $ quickly share Amusez vous bien !

source: Quickly %s Python interpreter: %s %s Python standard library: /usr/lib/python2.6 Quickly used library: %s Quickly data path: %s Quickly detected template directories: %s Copyright 2009 Canonical Ltd. #Author 2009 Rick Spencer #Author 2009 Didier Roche https://launchpad.net/quickly quickly comes with ABSOLUTELY NO WARRANTY. quickly is free software, and you may use, modify and redistribute it under the terms of the GNU General Public License version 3 or later.
cs: Quickly %s Python interpret: %s %s Python standardní knihovna: /usr/lib/python2.6 Quickly použitá knihovna: %s Quickly cesta k datům: %s Quickly nalezené adresáře šablon: %s Copyright 2009 Canonical Ltd. #Author 2009 Rick Spencer #Author 2009 Didier Roche https://launchpad.net/quickly quickly comes with ABSOLUTELY NO WARRANTY. quickly is free software, and you may use, modify and redistribute it under the terms of the GNU General Public License version 3 or later.
fr: Quickly %s Interpréteur Python: %s %s Bibliothèque standard Python: /usr/lib/python2.6 Bibliothèque Quickly utilisée: %s Répertoire des données de Quickly: %s Répertoires des modèles de Quickly: %s Copyright 2009 Canonical Ltd. #Author 2009 Rick Spencer #Author 2009 Didier Roche https://launchpad.net/quickly quickly est livré SANS AUCUNE GARANTIE, quickly est un logiciel libre et vous pouvez l'utiliser, le modifier et le redistribuer sous les termes de la GNU General Public License, version 3 ou plus récente.

source: ERROR: command '%s' in '%s' not found.
cs: CHYBA: příkaz '%s' v '%s' nebyl nalezen.
fr: ERREUR: commande '%s' introuvable dans '%s'.

source: ERROR: No command found
cs: CHYBA: Příkaz nenalezen
fr: ERREUR: Aucune commande trouvée

source: ERROR: %s is already a project. You can't create a project within another project. Please choose another path.
cs: CHYBA: %s už je projektem. Nemůžete vytvořit projekt uvnitř jiného projektu. Vyberte prosím jinou cestu.
fr: ERREUR: %s est déjà un projet. Vous ne pouvez pas créer un projet à l'intérieur d'un autre. Merci de sélectionner un autre chemin.

source: ERROR: %s command must be followed by a template and destination name
cs: CHYBA: %s příkaz musí být následován šablonou a názvem cíle
fr: ERROR: la commande %s doit être suivie d'un modèle et d'un nom de cible

source: ERROR: pre_%s command failed
cs: CHYBA: pre_%s příkaz selhal
fr: ERREUR: la commande pre_%s a échoué

source: ERROR: post_%s command failed
cs: CHYBA: post_%s příkaz selhal
fr: ERREUR: la commande post_%s a échoué

source: ------------------------------- Welcome to quickly! ------------------------------- You can create a project in executing 'quickly create <template_name> <your project>'. Example with ubuntu-application template: 1. create a Ubuntu Project and run the tutorial: $ quickly create ubuntu-application foo $ cd foo $ quickly help 2. You can also try: $ quickly edit $ quickly glade $ quickly run Use bash completion to get every available commands 3. How to play with package and release: optional, but recommended to build first your package locally: $ quickly package BE WARNED: the two following commands will connect to Launchpad. You need at least having a Launchpad account and an opened ppa. You need also for quickly release a project where you can bind your work with. $ quickly release or $ quickly share Have Fun!
cs: ------------------------------- Vítejte v quickly! ------------------------------- Můžete vytvořit projekt spuštěním 'quickly create <název_šablony> <váš_projekt>'. Příklad s ubuntu-application šablonou: 1. vytvoření Ubuntu projektu a spuštení tutoriálu: $ quickly create ubuntu-application foo $ cd foo $ quickly help 2. Také můžete zkusit: $ quickly edit $ quickly glade $ quickly run Použijte bash dokončování, abyste získali všechny dostupné příkazy. 3. Jak si hrát s balíkem a vydáním: volitelné, ale doporučeno je sestavit nejprve váš balík lokálně: $ quickly package VAROVÁNÍ: následující příkazy se připojí k Launchpadu. Potřebujete mít alespoň Launchpad účet a otevřené ppa. Pro quickly release také potřebujete Launchpad projekt, s kterým můžete spojit svoji práci. $ quickly release nebo $ quickly share Užijte si to!

source: Usage: quickly [OPTIONS] command ... Options: -t, --template <template> Template to use if it differs from default project one one used to create the project) --staging Target launchpad staging server --verbose Verbose mode -h, --help Show help information Commands: create <template> <project-name> (template is mandatory for this command) quickly <template_origin> <template_dest> to create a create derived template getstarted to get some starting hints Examples: quickly create ubuntu-application foobar quickly push 'awesome new comment system' quickly -t cool-template push 'awesome new comment system'
cs: Použití: quickly [VOLBY] příkaz ... Volby: -t, --template <šablona> Šablona, která se použije, pokud se liší od výchozí projektové šablony --staging Cílový Launchpad staging server --verbose Upovídaný mód -h, --help Ukázat nápovědu Commands: create <template> <project-name> (template is mandatory for this command) quickly <template_origin> <template_dest> to create a create derived template getstarted to get some starting hints Examples: quickly create ubuntu-application foobar quickly push 'awesome new comment system' quickly -t cool-template push 'awesome new comment system'

source: ERROR: No template provided and none found in the current tree. Ensure you don't want to create a new project or that your are in your directory project.
cs: CHYBA: Nebyla poskytnuta žádná šablona a ani v současném stromě nebyla žádná nalezena. Ujistěte se jestli nechcete vytvořit nový projekt nebo jestli jste v adresáři projektu.

source: sentence_name
gl: nome_sentenza
