Repository: didrocks/quickly
Catalog: po/*.po
Languages: cs, fr, gl, it, nl

source: A convenience command to open all of your python files in your project directory in your default editor, ready for editing. If you put yourself EDITOR or SELECTED_EDITOR environment variable, this latter will be used. Also, if you configured sensible-editor, this one will be choosed.
it: Comodo comando per aprire tutti i file python della directory del progetto nell'editor predefinito, pronti per essere modificati. Si potrà modificare l'editor da usare impostando la variabile di ambiente EDITOR o SELECTED_EDITOR. Inoltre, se si imposta sensible-editor, verrà utilizzata come impostazione predefinita.

source: quickly create <template> <project-name>
it: quickly create <modello> <nome-progetto>

source: This will create and run a new project, including Python code, Glade files, and packaging files to make the project work. After creating the project, get started by: 1. Changing your working directory to the new project: $ cd path/to/project-name 2. Edit the UI with Glade: $ quickly design 3. Edit the Python code: $ quickly edit
it: Questa operazione crea ed esegue un nuovo progetto, includendo del codice Python, dei file Glade ed i file del packaging per permettere al progetto di funzionare. Dopo aver creato il progetto, iniziare con: 1. Spostandosi nella directory di lavoro : $ cd percorso/del/progetto 2. Modificando dell'interfaccia grafica con Glade: $ quickly design 3. Scrivendo del codice Python: $ quickly edit

source: Creating bzr repository and committing
it: Creazione repository bzr e commit

source: Launching your newly created project!
cs: Spouštění vašeho nově vytvořeného projektu!
fr: Lancement de votre projet nouvellement créé
gl: Lanzando o seu proxecto recén creado!
it: Esecuzione del progetto appena creato.
nl: Opstarten van uw nieuw aangemaakt project!

source: Congrats, your new project is setup! cd %s/ to start hacking.
it: Congratulazioni, il nuovo progetto è stato creato! Digitare cd %s/ per iniziare l'hacking.

source: Usage: $ quickly tutorial Opens help file with the tutorial for the current template.
it: Uso: $ quickly tutorial Apre i file di aiuto con il tutorial per il modello corrente.

source: quickly configure lp-project [project-name]
it: quickly configure lp-project [nome-progetto]

source: quickly configure ppa <ppa-name>
it: quickly configure ppa <nome-ppa>

source: quickly configure target-distribution <ubuntu-release-name>
it: quickly configure target-distribution <nome-release-ubuntu>

source: Enable to set or change some parameters of the project, like which launchpad project should be bound with the current ubuntu application, what PPA should we use by default to share your package, what additional dependencies should be added… Note: If you are specifying a target-distribution apart from the one you are running, be warned that dependency detection may not be as accurate due to (rare) discrepancies between distributions.
it: Permette di impostare o cambiare alcuni parametri del progetto, come il progetto launchpad da collegare all'applicazione corrente, quale PPA deve essere usato, quali dipendenze aggiuntive devono essere inserite... Nota: se viene specificato una target-distribution diversa da quella in uso, potrebbe capitare che il rilevamento automatico delle dipendenze non sia così accurata a causa di alcune (rare) discrepanze tra versioni.

source: Use shell completion to find all available PPAs
it: Usa il completamento della shell per trovare tutti i PPA disponibili

source: User or team %s not found on Launchpad
it: Utente o gruppo %s non presente in Launchpad

source: You have to be a member of %s team to upload to its PPAs
it: Occorre essere membri del gruppo %s per poter caricare nel PPA

source: %s does not exist. Please create it on launchpad if you want to upload to it. %s has the following PPAs available:
it: %s non esiste. Crearlo su Launchpad se si desidera caricarvi i pacchetti. %s ha i seguenti PPA:

source: Updating project name references in existing apport crashdb configuration
it: Aggiornamento referenze del nome progetto nella configurazione di apport crashdb esistente

source: Creating new apport crashdb configuration
it: Creazione nuova configurazione apport crashdb

source: Creating new apport hooks
it: Creazione nuovi apport hooks

source: Adding launchpad integration to existing application
it: Aggiunta dell'integrazione con Launchpad all'applicazione esistente

source: quickly license [license-name]
it: quickly license [nome-licenza]

source: Candidate licenses: %s
it: Licenze disponibili: %s

source: Adds license to project files. Before using this command, you should: 1. Edit the file AUTHORS to include your authorship (this step is automatically done if you directly launch 'quickly release' or 'quickly share' before changing license) In this case, license is GPL-3 by default. 2. If you want to put your own quickly unsupported Licence, add a COPYING file containing your own licence and execute $ quickly license other. 3. Executes either 'quickly license' or 'quickly license <License>' where <License> can be either: - GPL-3 (default) - GPL-2 - other This will modify the COPYING file with the chosen licence (with GPL-3 by default). Updating previous chosen Licence if needed. If you previously removed the tags to add your own licence, it will leave it pristine. If no name is attributed to the Copyright, it will try to retrieve it from Launchpad (in 'quickly release' or 'quickly share' command only) Finally, this will copy the Copyright at the head of every files. Note that if you don't run 'quickly licence' before calling 'quickly release' or 'quickly share', this one will execute it for you and guess the copyright holder from your launchpad account if you didn't update it.
it: Aggiunge la licenza ai file del progetto. Prima di eseguire questo comando occorre: 1. Modificare il file AUTHORS per includere gli autori (questo passo viene eseguito automaticamente se viene lanciato "quickly release" o "quickly share" prima di cambiare licenza) In questo caso la licenza predefinita è la GPL-3. 2. Se si desidera inserire una licenza personalizzata, aggiungere il file COPYING contenente il testo della licenza ed eseguire il comando "quickly license other". 3. Eseguire indifferentemente "quickly license" oppure "quickly license <licenza>" dove <licenza> può essere: - GPL-3 (predefinita) - GPL-2 - other Questo modificherà il file COPYING con la licenza scelta (GPL-3 come predefinita). Modificare la licenza precedentemente scelta, se necessario. Se sono state precedentemente rimosse le intestazioni per aggiungere la licenza personalizzata, essa verrà mantenuta intatta. Se non viene specificato un nome nel Copyright, esso potrà essere recuperato da Launchpad (soltanto con i comandi "quickly release" o "quickly share") Alla fine, l'intestazione della licenza sarà inserita in cima ad ogni file del progetto. Notare che se non si esegue "quickly licence" prima di chiamare "quickly release" o "quickly share" questo verrà chiamato implicitamente e verranno determinate le informazioni sull'autore dall'account Launchpad.

source: WARNING: %s was not found in the file %s. No licence replacement
fr: ATTENTION : %s n'a pas été trouvé dans le fichier %s. Pas de modification de licence
gl: AVISO: non se atopou %s no ficheiro %s. Non hai reemprazo para a licenza
it: ATTENZIONE: %s non è stato trovato nel file %s. La licenza non è stata cambiata
nl: WAARSCHUWING: %s is niet gevonden in het bestand %s. Geen lisentie vervanging

source: %s file was not found
cs: %s soubor nebyl nalezen
fr: Impossible de trouver le fichier %s
gl: Non se atopou o ficheiro %s
it: File %s non trovato
nl: %s bestand is niet gevonden

source: COPYING contains an unknown license. Please run 'quickly license other' to confirm that you want to use a custom license.
it: Il file COPYING contiene una licenza sconosciuta. Eseguire "quickly license other" per confermare che si intende usare una licenza personalizzata.

source: Unknown licence %s.
it: Licenza sconosciuta %s.

source: Copyright is not attributed. Edit the AUTHORS file to include your name for the copyright replacing <Your Name> <Your E-mail>. Update it in setup.py or use quickly share/quickly release to fill it automatically
it: Il copyright non è specificato. Modificare il file AUTHORS per includere il proprio nome sostituendolo a <Your Name> <Your E-mail>. Modificare anche il file setup.py o usare "quickly share" o "quickly release" per compilarlo automaticamente.

source: %s file was not found. It is compulsory for user defined license
it: File %s non trovato. È obbligatorio per usare una licenza personalizzata

source: Header of %s license not found. Quickly installation corrupted?
it: Intestazione della licenza %s non trovata. È possibile che l'installazione di Quickly sia danneggiata.

source: Can't update license in setup.py file
it: Impossibile aggiornare la licenza nel file setup.py

source: %s file not found.
it: File %s non trovato

source: This command only take one optional argument.
it: Questo comando richiede solo un argomento opzionale.

source: Runs your application. This is the best way to try test it out while you are developing it. It starts up the main project window. $ quickly run -- values -<whathever> to pass '-whatever' and 'values' to the executed program. Without that if you use for instance --help, it would be Quickly help and not your program one.
it: Esegue l'applicazione. Questo è il modo migliore per provarla mentre si sta sviluppando. Verrà aperta la finestra principale del progetto. $ quickly run -- valori -<qualsiasi> per passare "-qualsiasi" e "valori" all'esecuzione del programma. Senza di essi se usate, per esempio, il parametro --help verrà lanciato l'help di Quickly e non quello del programma.

source: Can't access to X server, so can't run gtk application
it: Impossibile accedere al server X pertanto l'applicazione gtk non può essere eseguita

source: Can't execute %s
cs: Nelze provést %s
fr: Ne peut pas exécuter %s
gl: Non se pode executar %s
it: Impossibile eseguire %s
nl: Kan %s niet uitvoeren

source: _Example entry:
it: Voce di _Esempio:

source: sentence_name Preferences
it: sentence_name Preferenze

source: ERROR: Can't load configuration in current path or its parent ones.
cs: CHYBA: Nelze načíst konfiguraci v současné cestě nebo jejích předchudcích.
gl: ERRO: Non foi posíel cargar a configuración no camiño actual ou nos seus pais.
it: ERRORE: impossibile caricare la configurazione nel percorso corrente o in quello superiore.
nl: FOUT: Kan de configuratie niet draaien in huidige path of zijn bovenliggende path.

source: ERROR: Can't load configuration in %s: %s
cs: CHYBA: Nelze načíst konfiguraci v %s: %s
fr: ERREUR: Impossible de charger la configuration dans %s: %s
gl: ERRO: Non se puido cargar a configuración en %s: %s
it: ERRORE: impossibile caricare la configurazione in %s: %s
nl: FOUT: Kan de configuratie niet laden van %s: %s

source: ERROR: Can't save configuration in %s
it: ERRORE: impossibile salvare la configurazione in %s

source: adds a help guide to your project. To edit the guide, run: $ quickly edit All the help pages are loaded into your editor as well as the python files.
it: aggiunge una guida utente al progetto. Per modificare la guida, usare: $ quickly edit Tutte le pagine della guida sono caricate nell'editor così come i file Python.

source: Calling GPG to create tarball signature...
it: Esecuzione di GPG per creazione archivio firmato...

source: Signing the tarball failed, not uploading the signature
it: Firma dell'archivio non riuscita, mancato invio al server

source: New release available: %s
it: Nuova versione disponibile: %s

source: An error happened during tarball upload:
it: Si è verificato un errore durante l'invio dell'archivio:

source: Opens help file with the tutorial for the current template.
it: Apre i file di aiuto con il tutorial del modello corrente.

source: Add something to your project
it: Aggiunge un elemento al progetto

source: Cannot add, no plugin name provided.
it: Impossibile aggiungere, nome plugin mancante.

source: Cannot add, did not recognize plugin name: %s
it: Impossibile aggiungere, nome plugin %s non riconosciuto

source: Bzr not properly installed
gl: Bzr non está instalado correctamente
it: Bzr non è installato correttamente
nl: Bzr niet correct geïnstalleerd

source: Debugs your application with winpdb. $ quickly debug -- values -<whatever> to pass '-whatever' and 'values' to the executed program. Without that if you use for instance --help, it would be Quickly help and not your program one.
it: Esegue il debug dell'applicazione con winpdb. $ quickly debug -- valori -<qualsiasi> per passare "-qualsiasi" e "qualsiasi" all'esecuzione del programma. Senza di essi, se usate per esempio --help, verrà mostrato l'help di Quickly e non quello del programma.

source: Can't access to X server, so can't run winpdb
it: Impossibile accedere al server X pertanto winpdb non può essere eseguito

source: Can't execute winpdb
it: Impossibile eseguire winpdb

source: Can't rename LICENSE file, check your file permission
it: Impossibile rinominare il file LICENSE, controllare i permessi

source: WARNING: can't update your project to support /opt. This doesn't matter if you don't plan to submit your project to the application review board. Cause is: %s
it: ATTENZIONE: impossibile aggiornare il progetto per supportare l'installazione in /opt. Questo non è un problema se non si ha intenzione di inviare il progetto all'Application Review Board. La causa è: %s

source: Show debug messages (-vv debugs python_name_lib also)
it: Mostra messaggi di debug (-vv debugs python_name_lib)

source: quickly submitubuntu [--ppa <ppa | group/ppa>] [release-version] [comments]
it: quickly submitubuntu [--ppa <ppa | group/ppa>] [versione] [commenti]

source: Posts a release of your project and submit it the ubuntu application review board so that any users can see and install the application ont their system. Before running 'quickly submitubuntu', you should: create your account and a project page on http://launchpad.net. You also have to add a PPA to your launchpad account. Name, email, and version will be automatically changed in setup.py and bzr will tag the current source with the new version number. If not specified, the new version number will be 'YEAR.MONTH[.RELEASE]'. For example, the third release in July 2010 would be versioned 10.07.2. You may want to make sure that the description and long description in setup.py are up to date before releasing. You can optionally run 'quickly package' and test your package to make sure it installs as expected.
it: Pubblica una versione del vostro progetto e la invia all'Application Review Board di Ubuntu in modo da permettere a qualsiasi utente di vedere ed installare l'applicazione nel proprio sistema. Prima di eseguire "quickly submitubuntu", occorre creare il proprio account e la pagina progetto su http://launchpad.net. Sarà necessario anche aggiungere un PPA all'account launchpad. Nome, email e numero di versione verranno automaticamente cambiato in setup.py e bzr creerà un tag per la versione corrente. Se non specificato, il numero di versione sarà "ANNO.MESE[.VERSIONE]". Per esempio, il terzo rilascio del luglio 2010 sarà la versione 10.07.2. È opportuno assicurarsi che la descrizione breve e quella lunga nel file setup.py siano correttamente aggiornate prima del rilascio. È opzionalmente possibile eseguire "quickly package" per provare il pacchetto ed essere sicuri che venga installato come dovrebbe.

source: No PPA provided.
it: Nessun PPA fornito.

source: Unknown option: %s.
it: Ozione sconosciuta: %s.

source: User or Team %s not found on Launchpad
it: Utente o gruppo %s non presente su Launchpad

source: You have to be a member of %s team to upload to its ppas
it: Occorre essere membro del gruppo %s per caricare pacchetti nel ppa

source: %s does not exist. Please create it on launchpad if you want to push a package to it. %s has the following ppas available:
it: %s non esiste. Crearlo in Launchpad per caricarvi i pacchetti. %s ha i seguenti ppa:

source: You can temporary choose one of them with --ppa switch or definitely by executing 'quickly configure ppa <ppa_name>'.
it: È possibile scegliere temporaneamente uno di essi specificando l'opzione --ppa o impostarlo lanciando il comando "quickly configure ppa <nome_ppa>"

source: quickly released: %s
cs: quickly vydáno: %s
fr: Publié par quickly : %s
gl: lanzouse quickly: %s
it: quickly versione: %s
nl: quickly vrijgegeven: %s

source: ERROR: quickly can't release: %s seems to be already released. Choose another name.
cs: CHYBA: nelze vydat: %s se zdá být už vydán. Vyberte jiný název.
fr: ERREUR : quickly ne peut pas publier: %s semble déjà l'être. Veuillez choisir un autre nom.
gl: ERRO: quickly non pode lanzar: %s semella que xa foi lanzada. Seleccione outro nome.
it: ERRORE: quickly non può fare il rilascio: Sembra che %s sia già rilasciato. Scegliere un altro nome.
nl: FOUT: quickly kan niet vrijgeven: %s is blijkbaar reeds vrijgegeven. Kies een andere naam.

source: commit before release
it: Esecuzione commit prima del rilascio

source: ERROR: quickly can't release as it can't commit with bzr
cs: CHYBA: nelze vydat jelikož nelze odevzdat (commit) pomocí bzr
fr: ERREUR : quickly ne peut publier car il ne peut sauvegarder la révision par bzr
gl: ERRO: quickly non pode lanzar xa que vostede non pode remitir cambios con bzr
it: ERRORE: quickly non può eseguire il rilascio in quanto non può eseguire il commit su bzr
nl: FOUT: quickly kan niet vrijgeven omdat het niet kan committen met bzr

source: ERROR: can't create or update ubuntu package
cs: CHYBA: nelze vytvořit nebo aktualizovat ubuntu balík
fr: ERREUR : Impossible de créer ou de mettre à jour le paquet Ubuntu
gl: ERRO: non se pode crear ou actualizar o paquete de ubuntu
it: ERRORE: impossibile creare o aggiornare il pacchetto
nl: FOUT: Kan ubuntu package niet aanmaken of updaten

source: ERROR: quickly can't release: can't pull from launchpad.
cs: CHYBA: nelze vydat: nelze provést pull z Launchpadu.
fr: ERREUR : quickly ne peut publier : il ne peut synchroniser les modifications depuis Launchpad.
gl: ERRO: quickly non se pode liberar: non se pode facer un pull dende launchpad.
it: ERRORE: quickly non può eseguire il rilascio: impossibile recuperare le informazioni da launchpad.
nl: FOUT: quickly kan niet vrijgeven: kan niet trekken van launchpad.

source: ERROR: quickly can't release: can't push to launchpad.
cs: CHYBA: nelze vydat: nelze provést push do Launchpadu.
fr: ERREUR : quickly ne peut publier : il ne peut envoyer les modifications sur Launchpad.
gl: ERRO: quickly non se pode liberar: non se pode facer un push a launchpad.
it: ERRORE: quickly non può eseguire il rilascio: impossibile inviare le informazioni a launchpad.
nl: FOUT: quickly kan niet vrijgeven: kan niet drukken naar launchpad.

source: ERROR: quickly can't release correctly: can't pull from launchpad.
cs: CHYBA: nelze vydat správně: nelze provést pull z Launchpadu.
fr: ERREUR : quickly ne peut publier correctement : il ne peut rafraichir les données depuis Launchpad.
gl: ERRO: quickly non pode liberar correctamente: non se pode facer un pull dende launchpad.
it: ERRORE: quickly non può eseguire il rilascio correttamente: impossibile recuperare le informazioni da launchpad.
nl: FOUT: quickly kan niet correct vrijgeven: kan niets nemen van launchpad.

source: pushing to launchpad
cs: provádím push do Launchpadu
fr: envoi sur Launchpad
gl: facendo un push a launchpad
it: invio delle informazioni a launchpad
nl: drukken naar launchpad

source: %s %s released and submitted to ubuntu. Wait for half an hour and have look at %s.
it: %s %s rilasciato e sottomesso in ubuntu. Attendere circa mezz'ora e controllare su %s.

source: Then your application will be reviewed by the application review board.
it: Quindi l'applicazione verrà revisionata dall'Application Review Board.

source: Command returned some ERRORS:
it: Il comando ha restituito degli errori:

source: Command returned some WARNINGS:
it: Il comando ha restituito dei warning:

source: An error has occurred when creating debian packaging
it: Si è verificato un errore creando il pacchetto debian

source: Ubuntu packaging created in debian/
cs: Ubuntu balíčkování vytvořeno v debian/
gl: Empaquetado de ubuntu creado en debian/
it: Pacchetto Ubuntu creato in debian/
nl: Ubuntu packaging aangemaakt in debian/

source: ERROR: an error occurred during source package creation
cs: CHYBA: během vytváření zdrojového balíku se vyskytla chyba
fr: ERREUR: une erreur est survenue lors de la création du paquet source
gl: ERRO: ocorreu un erro durante a creación do paquete de fontes
it: ERRORE: si è verificato un errore durante la creazione del pacchetto sorgente
nl: FOUT: er is een fout opgetreden de aanmaak van de bron package

source: ERROR: an error occurred during source upload to launchpad
cs: CHYBA: během nahrávání zdroje na Launchpad se vyskytla chyba
fr: ERREUR: une erreur est survenue pendant l'envoi des sources sur launchpad
gl: ERRO: ocorreu un erro mentres se subia a fonte a Launchpad
it: ERRORE: si è verificato un errore durante il caricamento del sorgente su launchpad
nl: FOUT: er is een fout opgetreden gedurende de bron upload naar launchpad

source: Release version specified in command arguments is not a valid version scheme like 'x(.y)(.z)'.
it: Il numero di versione specificato nei parametri non è in un formato valido, come "x(.y)(.z)".

source: No previous version found in setup.py. Put one please
it: Numero di versione precedente non trovato nel file setup.py. Inserirne uno

source: Share version specified after -public in setup.py is not a valid number: %s
it: Versione di rilascio specificata dopo -public nel file setup.py non è un valore valido: %s

source: Minor version specified in setup.py is not a valid number: %s. Fix this or specify a version as release command line argument
it: Il valore di minor version specificato nel file setup.py non è valido: %s. Occorre correggerlo o specificarlo come paramentro del comando release

source: ERROR: %s command failed
cs: CHYBA: %s příkaz selhal
fr: ERREUR: la commande %s a échoué
gl: ERRO: a orde %s fallou
it: ERRORE: comando %s non riuscito
nl: FOUT: %s commando gefaald

source: Aborting
cs: Ukončování
fr: Annulation
gl: Abortando
it: Interruzione
nl: Afbreken

source: ERROR: Can't find project in %s. Ensure you launch this command from a quickly project directory.
cs: CHYBA: Nelze nalézt projekt v %s.
fr: ERREUR: Impossible de trouver un projet dans %s. Assurez-vous que vous lancez cette commande depuis un dossier de projet quickly.
gl: ERRO: Non se pode atopar o proxecto en %s. Asegúrese que quere executar esta orde dende o cartafol do proxecto de quickly.
it: ERRORE: Impossibile trovare il progetto in %s. Occorre lanciare questo comando da una directory di un progetto creato con quickly
nl: FOUT: Kan geen project vinden in %s. Vergewis u ervan dat u dit commando uitvoorde vanuit een quickly project directory.

source: ERROR: %s is a project. You can't launch %s command within a project. Please choose another path.
it: ERRORE: %s è un progetto. Impossibile lanciare il comando %s all'interno di un progetto. Scegliere un altro percorso.
nl: FOUT: %s is een project. U kan geen %s commando uitvoeren vanuit een project. Gelieve een ander pathte gebruiken.
