Repository: didrocks/quickly
Catalog: po/*.po
Languages: cs, fr, gl, it, nl

source: Usage: $ quickly create ubuntu-flash-game path/to/project_name path/to/myflashgame.swf where 'project_name' is one or more words separated by an underscore and path/to can be any existing path. This will create a new project which runs your existing SWF, myflashgame.swf, on the Ubuntu desktop, and makes it ready to be packaged and distributed in the Ubuntu Software Centre. After creating the project, you'll want to specify the title of your game and the size of the window: 1. Changing your working directory to the new project: $ cd path/to/project_name 2. Edit the code and specify the title and window size: $ quickly edit
it: Uso: $ quickly create ubuntu-flash-game percorso/del/nome_progetto percorso/del/miogiocoflash.swf dove "nome_progetto" è una o più parole separate da underscore e path/del deve essere un percorso esistente. Questo creerà un nuovo progetto che lanci il file SWF chiamato miogiocoflash.swf, sul desktop di Ubuntu, e lo renda pronto per essere pacchettizzato e distribuito nel Software Center di Ubuntu. Dopo la creazione del progetto, è opportuno specificare il titolo del gioco a la dimensione della finestra: 1. Spostarsi nella directory di lavoro del progetto: $ cd percorso/del/nome_progetto 2. Modifica del codice per specificare il titolo e la dimensione della finestra: $ quickly edit

source: Project name not defined. Usage: $ quickly create ubuntu-flash-game project_name myflashgame.swf
it: Nome progetto non definito. Uso: $ quickly create ubuntu-flash-game nome_progetto miogiocoflash.swf

source: Flash SWF file not defined. Usage: $ quickly create ubuntu-flash-game project_name myflashgame.swf
it: File flash SWF non definito. Uso: $ quickly create ubuntu-flash-game nome_progetto miogiocoflash.swf

source: Flash SWF file %s not found. Usage: $ quickly create ubuntu-flash-game project_name myflashgame.swf
it: File flash SWF "%s" non trovato. Uso: $ quickly create ubuntu-flash-game nome_progetto miogiocoflash.swf

source: Creating bzr repository and commiting
cs: Vytváření bzr repozitáře a odevzdávání (commit)
fr: Création du dépôt bzr et commit
gl: Creando o repositorio bzr e remitindo
it: Creazione repository bzr e commit
nl: Aanmaken van bzr repository en committen

source: Congratulations, your new project is set up! cd %s/ to edit the details.
it: Congratulazioni, il progetto è stato creato! Digitare cd %s/ per iniziare a modificarlo.

source: This will add support for Ubuntu Application Indicator to your quickly project. Next time you run your app, the Indicator will show up in the panel on top right. You can add/remove/modify items from the indicator menu by editing indicator.py
it: Questo aggiungerà il supporto per l'Application Indicator di Ubuntu nel progetto. La prossima volta che verrà eseguita l'applicazione, l'indicatore sarà mostrato nel pannello in alto a destra. È possibile aggiungere, rimuovere o modificare le voci del menu modificando indicator.py

source: No project name specified.
it: Nome progetto non specificato.

source: There is already a file or directory named %s
cs: Soubor nebo adresář s názvem %s již existuje
fr: Il exsite déjà un fichier ou répertoire nommé %s
gl: Xa hai un ficheiro ou cartafol co nome %s
it: Esiste già un file o una directory chiamata %s
nl: Er is reeds een bestand of map met de naam %s

source: Creating project directory %s
cs: Vytváření projektového adresáře %s
fr: Création du répertoire du projet %s
gl: Creando o cartafol do proxecto %s
it: Creazione directory progetto %s
nl: Aanmaken van project directory %s

source: List all commands ordered by templates
it: Elenca tutti i comandi ordinati per modello

source: Give some getstarted advice
it: Fornisce alcuni consigli per iniziare

source: ------------------------------- Welcome to Quickly! ------------------------------- You can create a project by executing 'quickly create <template-name> <your-project>'. Example with ubuntu-application template: 1. create an ubuntu application and run the tutorial: $ quickly create ubuntu-application foo $ cd foo $ quickly tutorial 2. You can also try: $ quickly edit $ quickly design $ quickly run Use bash completion to get every available command 3. How to play with a package and release it: Optional (but recommended): build your package locally: $ quickly package BE WARNED: the two following commands will connect to Launchpad. Make sure that you have a Launchpad account and a PPA! You can find out more about setting up a Launchpad account and Launchpad features at https://launchpad.net/ $ quickly release or $ quickly share Have Fun!
it: ------------------------------- Benvenuti in Quickly! ------------------------------- È possibile creare un progetto con il comando "quickly create <nome-modello> <nome-progetto>". Esempio con il modello ubuntu-application: 1. creare un'applicazione ubuntu e lanciare il tutorial: $ quickly create ubuntu-application prova $ cd prova $ quickly tutorial 2. Potete provare anche $ quickly edit $ quickly design $ quickly run Usare il completamento della bash per avere l'elenco dei comandi disponibili 3. Come costruire il pacchetto e rilasciarlo: Passo opzionale (ma raccomandato): creare il pacchetto localmente: $ quickly package ATTENZIONE: i 2 comandi di seguito si connetteranno a Launchpad. Assicuratevi di avere un account su Launchpad e un PPA! È possibile trovare ulteriori informazioni riguardo Launchpad all'indirizzo https://launchpad.net/ $ quickly release oppure $ quickly share Buon divertimento!

source: Get help from commands
it: Fornisce aiuto sui comandi

source: Usage: quickly help [template] <command>
it: Uso: quickly help [modello] <comando>

source: Create a new quickly template from an existing one
it: Crea un nuovo modello da uno esistente

source: Usage: quickly quickly [origin-template] destination-template
it: Uso: quickly quickly [modello-originale] modello-destinazione

source: No destination template name provided.
it: Nome del modello di destinazione mancante.

source: %s already exists.
cs: %s už existuje.
fr: %s existe déjà.
gl: %s xa existe.
it: Esiste già %s.
nl: %s bestaat reeds.

source: Copy %s to create new %s template
fr: Copiez %s pour créer un nouveau modèle %s
gl: Copie %s para crear un novo modelo %s
it: Copiare %s per creare il nuovo modello %s
nl: Copiëer %s om een nieuwe %s template aan te maken

source: quickly release [--ppa <ppa | group/ppa>] [release-version] [comments]
it: quickly release [--ppa <ppa | group/ppa>] [versione] [commenti]

source: Posts a release of your project to a PPA on launchpad so that users can install the application on their system. Before running 'quickly release', you should: create your account and a project page on http://launchpad.net. You also have to add a PPA to your launchpad account. Name, email, and version will be automatically changed in setup.py and bzr will tag the current source with the new version number. If not specified, the new version number will be 'YEAR.MONTH[.RELEASE]'. For example, the third release in July 2010 would be versioned 10.07.2. You may want to make sure that the description and long description in setup.py are up to date before releasing. You can optionally run 'quickly package' and test your package to make sure it installs as expected.
it: Pubblica una versione del progetto su un PPA di launchpad in modo che gli utenti possano installare l'applicazione nel sistema. Prima di eseguire "quickly release" occorre creare un account e una pagina progetto su http://launchpad.net. Dovete aver aggiunto anche un PPA nell'account. Nome, email e numero di versione verrà automaticamente cambiato in setup.py e bzr creerà un tag per la versione corrente. Se non specificato, il numero di versione sarà "ANNO.MESE[.VERSIONE]". Per esempio, il terzo rilascio del Luglio 2010 sarà la versione 10.07.2. È opportuno assicurarsi che la descrizione breve e lunga nel file setup.py sia correttamente aggiornato prima del rilascio. È opzionalmente possibile eseguire "quickly package" per testare il pacchetto ed essere sicuri che venga installato come atteso.

source: %s %s released and building on Launchpad. Wait for half an hour and have look at %s.
cs: %s %s vydán a sestavuje se na Launchpadu. Vyčkejte půl hodiny a podívejte se na %s.
fr: %s %s publié et en train d'être construit sur Launchpad. Attendez environ une demi-heure et vérifiez sur %s.
gl: %s %s liberado e construido en Launchpad. Agarde media hora e poderá ollalo en %s.
it: %s %s rilasciato e in corso di building su Launchpad. Attendere circa mezz'ora e controllare su %s
nl: %s %s vrijgegeven en samengesteld op Launchpad. Wacht een half uurtje en neem een kijkje naar %s.

source: This command tests your project using the contents of the tests directory
it: Questo comando esegue i test usando il contenuto della directory tests

source: Contents
it: Contenuti

source: Status Area
cs: Stavový prostor
fr: Zone d'État
gl: Área de estado
it: Barra di stato
nl: Voortgangs Veld

source: Your application has been created! To start changing this user interface, run 'quickly design', which will open Glade so you can edit the default windows and dialogs. To change the behavior and edit the python code, run 'quickly edit', which will bring up a text editor.
it: L'applicazione è stata creata! Per iniziare a cambiare l'interfaccia utente eseguire "quickly design" che apre GLADE per permettere la modfica delle finestre. Per cambiare il codice python eseguite "quickly edit", che apre l'editor di testo.

source: _Edit
cs: _Upravit
fr: Éditio_n
gl: _Editar
it: _Modifica
nl: B_ewerken

source: _Help
cs: _Nápověda
fr: Aid_e
gl: _Axuda
it: _Aiuto

source: _View
cs: _Zobrazit
fr: _Affichage
gl: _Ver
it: _Visualizza
nl: _Weergave

source: ERROR: Can't load setup.py file
cs: CHYBA: Nelze načíst soubor setup.py
fr: ERREUR : Impossible de charger le fichier setup.py
gl: ERRO: Non foi posíbel cargar o ficheiro setup.py
it: ERRORE: impossibile caricare il file setup.py
nl: FOUT: Kan setup.py file niet laden

source: quickly saved
cs: quickly uloženo
fr: Sauvegardé par quickly
gl: gardouse quickly
it: quickly salvato
nl: quickly opgeslaan

source: There is no GPG key detected for your Launchpad account. Please upload one as you can read on the tutorial
it: Non esiste una chiave GPG nell'account Launchpad. Caricarne una come specificato nel tutorial

source: You choosed to not create your GPG key.
it: Si è scelto di non creare la chiave GPG.

source: Can't create GPG key. Try to create it yourself.
it: Impossibile creare la chiave GPG. Provare a crearla manualmente.

source: Can't sign the package as no adress email found. Fulfill the AUTHORS file with name <emailadress> or export DEBEMAIL/EMAIL.
it: Impossibile firmare il pacchetto per la mancanza dell'indirizzo email. Completare il file AUTHORS sostituendo <emailadress> oppure impostare la variabile DEBEMAIL o EMAIL

source: GPG keys found matching no prefered email. You can export DEBEMAIL or put it in AUTHORS file one matching your local gpg key.
it: La chiave GPG trovata non corrisponde all'email specificata. Esportare la variabile DEBEMAIL o inserirne una nel file AUTHORS che sia presente nella chiave GPG locale.

source: No gpg key set matching launchpad one found.
it: La chiave gpg impostata non corrisponde a quella trovata su Launchpad.

source: Check whether python-launchpadlib is installed
cs: Zkontrolujte jestli je nainstalován python-launchpadlib
fr: Vérification de l'installation de python-launchpadlib
gl: Comprobe se python-launchpadlib está instalado
it: Controllare anche se python-launchpadlib è installato
nl: Controleer of python-launchpadlib geïnstalleerd is

source: WARNING: you are using staging and not launchpad real production server
fr: ATTENTION : Vous utilisez staging et pas le serveur de production de Launchpad
gl: AVISO: vostede está empregando staging e non o servidor de producción real en Launchpad
it: ATTENZIONE: si sta usando "staging" e non l'istanza di launchpad di produzione
nl: OPGELET: U gebruikt "staging" en niet de echte launchpad productie server

source: Get Launchpad Settings
cs: Získat nastavení Launchpadu
fr: Récupération de la configuration Launchpad
gl: Obter as configuracións de Launchpad
it: Recupero impostazioni di Launchpad
nl: Haal Launchpad Instellingen

source: Unknown reason
cs: Neznámý důvod
fr: Cause inconnue
gl: Razón descoñecida
it: Causa sconosciuta
nl: Onbekende reden

source: Couldn't setup Launchpad for quickly ; %s
fr: La configuration de Launchpad pour quickly a échoué ; %s
gl: Non foi posíbel configurar Launchpad con quickly: %s
it: Impossibile impostare Launchpad per quickly; %s
nl: Kon Launchpad niet instellen voor quickly ; %s

source: Launchpad connection is ok
cs: Spojení s Launchpadem v pořádku
it: Connessione con Launchpad funzionante

source: No launchpad project given, aborting.
it: Nessun progetto Launchpad fornito, interruzione.

source: ---------------- [%s] ---------------- %s -------------------------------------- Project name: %s Launchpad url: %s/%s %s
it: ---------------- [%s] ---------------- %s -------------------------------------- Nome progetto: %s Indirizzo Launchpad: %s/%s %s

source: No project found
cs: Nenalezen žádný projekt
fr: Aucun projet n'a été trouvé
gl: Non se atopou o proxecto
it: Nessun progetto trovato
nl: Geen project gevonden

source: Choose your project number
cs: Zvolte vaše číslo projektu
fr: Choisissez un numéro de projet
gl: Seleccione o número do proxecto
it: Scegliere il numero del progetto
nl: Kies uw project nummer

source: No right number given, aborting.
cs: Zadáno špatné číslo, přerušuji.
fr: Pas de numéro valide indiqué, annulation.
gl: Non se proporcionou un número correcto, abortando.
it: Numero fornito errato, interruzione.
nl: Geen correct nummer gegeven, afbreken.

source: Can't find %s project on Launchpad. You can try to find it interactively without providing a project name.
it: Impossibile trovare il progetto %s su Launchpad. È possibile provare a cercarlo interattivamente senza fornirne il nome.

source: Usage: $ quickly package Creates a debian file (deb) from your project. Before running the package command you can edit the Icon and Category entry of *.desktop.in file, where * is the name of your project. Note that if you didn't run 'quickly release', 'quickly share' or 'quickly change-lp-project' you may miss the name, email in setup.py. You can edit them if you don't want to use any of these commands afterwards. Those changes are not a mandatory at all for testing purpose.
it: Uso: $quickly package Crea un pacchetto debian (deb) per il progetto. Prima di eseguire il comando è possibile modificare l'icona e la categoria nel file *.desktop.in, dove * rappresenta il nome del progetto. Notare che se non si esegue "quickly release", "quickly share" oppure "quickly change-lp-project" si può perdere il nome, email in setup.py. È possibile modificarlo manualmente se non si desidera usare uno di questo comandi. Questi cambiamenti non sono obbligatori per svolgere delle prove.

source: Release version not found in setup.py.
cs: Verze vydání nenalezena v setup.py.
fr: Version publiée non trouvée dans setup.py
gl: Versión de liberación non atopada en setup.py.
it: Numero versione non trovato in setup.py.
nl: Vrijgave versie niet gevonden in setup.py.

source: Ubuntu package has been successfully created in ../%s_%s_all.deb
cs: Ubuntu balík byl úspěšně vytvořen v ../%s_%s_all.deb
fr: Le paquet Ubuntu a été crée avec succès en tant que ../%s_%s_all.deb
gl: O paquete de Ubuntu foi creado correctamente en ../%s_%s_all.deb
it: Il pacchetto Ubuntu è stato creato con successo in ../%s_%s_all.deb
nl: Ubuntu package is succesvol aangemaakt in ../%s_%s_all.deb

source: An error has occurred during package building
cs: Během sestavování balíku se objevila chyba
fr: Une erreur est survenue pendant la création du paquet
gl: Atopouse un erro mentresse construía o paquete
it: Si è verificato un errore durante la creazione del pacchetto
nl: Er is een fout opgetreden bij het aanmaken van de package

source: No quickly data path found in %s.
it: Percorso dati non trovato in %s.

source: No template found.
it: Modello non trovato.
nl: Geen template gevonden.

source: Quickly %s Python interpreter: %s %s Python standard library: %s Quickly used library: %s Quickly data path: %s Quickly detected template directories: %s Copyright 2009 Rick Spencer Copyright 2009-2011 Didier Roche Copyright 2010-2011 Canonical Ltd https://launchpad.net/quickly quickly comes with ABSOLUTELY NO WARRANTY. quickly is free software, and you may use, modify and redistribute it under the terms of the GNU General Public License version 3 or later.
it: Quickly %s Interprete Python: %s %s Libreria Python standard: %s Libreria in uso da Quickly: %s Percorso dei dati di Quickly: %s Directory dei modelli Quickly: %s Copyright 2009 Rick Spencer Copyright 2009-2010 Didier Roche Copyright 2010-2011 Canonical Ltd https://launchpad.net/quickly Quickly è fornito senza ALCUNA GARANZIA. Quickly è software libero ed è permesso l'uso, la modifica e la sua ridistribuzione secondo i termini della licenza GNU General Public License versione 3 o successive.

source: No help for this command
it: Aiuto non disponibile per questo comando
nl: Geen help voor dit commando

source: ERROR: unpermitted character in name. The name must start with a letter and contain only letters, spaces, dashes (-), and digits.
it: ERRORE: carattere non permesso nel nome. Il nome deve iniziare con una lettera e contenere soltanto lettere, spazi, trattini (-) e numeri.

source: ERROR: %s is not permitted as a quickly project name
it: ERRORE: %s non è permesso come nome progetto
nl: FOUT: %s is niet toegelaten als naam voor een quickly project

source: %s was not found in the file %s.
it: %s non è stato trovato nel file %s.

source: %s file was not found or can't update it
it: Il file %s non è stato trovato o non è possibile aggiornarlo

source: Usage:
it: Uso:

source: Candidate templates are: %s
it: Modelli candidati sono: %s

source: Candidate commands are: %s
it: Comandi candidati sono: %s

source: ERROR: %s
it: ERRORE: %s

source: Failed to add file to project cannot add: %s - this file already exists.
it: Impossibile aggiungere il file al progetto Il file %s non può essere aggiunto in quanto esiste già.

source: Updates your PPA with the the latest saved project changes. Before running 'quickly share', you should: create your account on http://launchpad.net. You also have to add a PPA to your launchpad account. Name, email, and version will be automatically changed in setup.py. The new version number will be 'CURRENT.VERSION-publicX', where X will be incremented each time you share. For example, if you most recently released 10.07.2 and you have shared the package three times since then, another run of 'quickly share' will use a new version of 10.07.2-public4. You can optionally run 'quickly package' and test your package to make sure it installs as expected.
it: Aggiorna il PPA con l'ultima versione del progetto. Prima di eseguire "quickly share" occorre aver creato l'account su http://launchpad.net. Occorre aver aggiunto anche un PPA all'account launchpad. Nome, email e versione verranno automaticamente cambiati in setup.py. La nuova versione sarà "CURRENT.VERSION-publicX", dove X verrà incrementato ogni volta che si richiama il comando share. Ad esempio, se si è rilasciata recentemente la versione 10.07.2 e si è fatto lo share del pacchetto 3 volte, una successiva "quickly share" produrrà la nuova versione 10.07.2-public4. È possibile eseguire opzionalmente "quickly package" per provare localmente il pacchetto e assicurarsi che si installi come dovrebbe.

source: %s %s is building on Launchpad. Wait for half an hour and have look at %s.
cs: %s %s se sestavuje na Launchpadu. Vyčkejte půl hodiny a pak se podívejte na %s.
fr: %s %s est en cours de construction sur Launchpad. Attendez une demi heure et allez à %s.
gl: %s %s está sendo construido en Launchpad. Agarde media hora e poderá ollalo en %s.
it: %s %s è in corso di build in Launchpad. Attendere circa mezz'ora e controllare su %s
nl: %s %s word aangemaakt op Launchpad. wacht een half uurtje en kijk naar %s.

source: Usage: quickly [OPTIONS] command ... Options: -t, --template <template> Template to use if it differs from default project template --staging Target launchpad staging server --verbose Verbose mode -h, --help Show help information Commands: create <template> <project-name> (template is mandatory for this command) quickly <template-origin> <template-dest> to create a create derived template getstarted to get some starting hints Examples: quickly create ubuntu-application foobar quickly push 'awesome new comment system' quickly -t cool-template push 'awesome new comment system'
it: Uso: quickly [OPZIONI] comando ... Opzioni: -t, --template <modello> Modello da usare se diverso da quello predefinito --staging Istanza staging (di test) di launchpad --verbose Modalità prolissa -h, --help Mostra l'aiuto Comandi: "create <modello> <nome-progetto>" (modello è obbligatorio in questo caso) "quickly <modello-origine> <modello-dest>" per creare un template da personalizzare "getstarted" per avere dei suggerimenti iniziali Esempi: quickly create ubuntu-application prova quickly push "inserire qui un commento" quickly -t mio-template push "inserire qui un commento"

source: %s is an invalid data path.
it: %s non è un percorso dati valido.

source: No template directory found. Aborting
cs: Adresář šablon nenalezen. Přerušuji
fr: Aucun répertoire de modèles trouvés. Annulation
gl: Non se atopou o cartafol de modelos. Abortando
it: Directory del modello non trovata. Interruzione
nl: Geen template directory gevonden. Afbreken

source: ERROR: Template %s not found. Aborting
it: ERROR: modello %s not found. Aborting

source: ERROR: %s needs one argument: %s
it: ERRORE: %s necessita di un parametro: %s

source: ERROR: No command provided in command line
it: ERRORE: nessun comando fornito nella riga di comando
nl: FOUT: Geen commando opgegeven in commando lijn

source: No command provided to %s command.
it: Nessun comando fornito per %s.

source: No template or command provided to %s command.
it: Nessun modello o comando fornito per %s.

source: No %s command found in %s template.
it: Comando %s non trovato nel modello %s.

source: %s is neither a template nor a standard command.
it: %s non è un modello né un comando.

source: Template %s does not exist.
it: Il modello %s non esiste.

source: No template provided to %s command.
it: Nessun modello fornito per il comando %s.

source: No %s command found.
it: Comando %s non trovato.

source: Opens Glade UI editor so that you can edit the UI for dialogs and windows in your project. Note that you *must* open Glade in this manner for quickly to work. If you try to open Glade directly, and the open the UI files, Glade will throw errors and won't open the files.
it: Apre l'editor Glade per poter modificare le finestre del progetto Notare che *occorre* aprire Glade in questa maniera per far sì che Quickly funzioni. Se si apre Glade direttamente, e si aprono i file interfaccia, Glade produrrà degli errore e non aprirà i file.

source: quickly save [comments]
it: quickly save [commenti]

source: This command commits all changes since the last save to bzr. Note that it does not push changes to any back up location. If you need revert or otherwise use the revision control, use bzr directly: $ bzr help
it: Questo comando applica tutte le modifiche dall'ultimo salvataggio a bzr. Notare che questo comando non salva le modifiche in alcun dispositivo di backup. Se si desidera recuperare una versione precedente o altre funzionalità del controllo di versione, usare bzr direttamente: $ bzr help
